import {PieChart, RatioChart} from "@/charts"

const data = [
  {
    name: "修读该课程的满意度（指实际修读课程的收获与选课期望的比较）",
    data: {
      "很满意": 6,
      "比较满意": 2,
      "一般": 1
    }
  },
  {
    name: "你对该门课程所教授内容的评价如何?",
    data: {
      "内容深浅合适，容易理解与接受": 7,
      "有些内容深浅合适，有些偏难": 2
    }
  },
  {
    name: "是否需要增加授课内容?",
    data: {
      "是": 3,
      "否": 6
    }
  },
  {
    name: "是否需要减少授课内容?",
    data: {
      "否": 8,
      "是": 1
    }
  },
  {
    name: "你对该门课程开设讨论课的实际效果如何评价?",
    data: {
      "很满意": 4,
      "满意": 4,
      "不知道": 1
    }
  }
]

const data_above = [
  {
    name: "修读该课程的满意度（指实际修读课程的收获与选课期望的比较）",
    data: {
      "很满意": 21,
      "比较满意": 5,
      "一般": 1
    }
  },
  {
    name: "你对该门课程所教授内容的评价如何?",
    data: {
      "内容深浅合适，容易理解与接受": 24,
      "有些内容深浅合适，有些偏难": 2,
      "内容较浅，之前均已掌握": 1
    }
  },
  {
    name: "是否需要增加授课内容?",
    data: {
      "否": 24,
      "是": 3
    }
  },
  {
    name: "是否需要减少授课内容?",
    data: {
      "否": 27
    }
  },
  {
    name: "你对该门课程开设讨论课的实际效果如何评价?",
    data: {
      "满意": 16,
      "很满意": 10,
      "不知道": 1
    }
  }
]

const display = () => {
  return <div className={"grid place-content-center"}>
    <div className={"grid grid-cols-2 place-content-center"}>
      <div>
        <PieChart
          title={"你获取生物科技资讯的主要方式是（可多选）"}
          data={{
            "A.看电影": 5,
            "D.阅读文献": 4,
            "F. 媒体（包括电视、报纸、微博、公众号等）": 7,
            "G.听讲座": 4,
            "B.小说": 5,
            "E.课堂": 8,
            "C.专业书籍": 3
          }}
          colors={[
            "rgb(62,238,211)",
            "rgb(236,119,199)",
            "rgba(126,10,241,0.5)",
            "rgba(229,53,255,0.9)",
            "rgb(87,215,236)",
            "rgb(236,55,97)",
            "rgba(255,211,12,0.88)"]}
        />
        <PieChart
          title={"你最关心的生物伦理学问题是（可多选）"}
          data={{
            "H.生态伦理": 1,
            "I. 生物技术伦理": 6,
            "A. 衰老": 5,
            "E.同性恋": 4,
            "G. 冻卵": 4,
            "L.人工智能": 4,
            "B. 死亡": 6,
            "J. 医学技术伦理": 3,
            "K.实验动物": 2,
            "C. 优生": 3,
            "D.代孕": 4
          }}
          labelClass={"grid grid-cols-2"}
          colors={[
            "rgb(236,119,199)",
            "rgb(87,215,236)",
            "#7bed9f",
            "rgb(236,55,97)",
            "#83C5BE",
            "rgba(229,53,255,0.9)",
            "#C62CF2",
            "#E29578",
            "#fd79a8",
            "rgb(62,238,211)",
            "rgba(126,10,241,0.5)"
          ]}
        />
        <PieChart
          title={"你最感兴趣的生物技术是（可多选）"}
          data={{
            "A. 基因工程": 4,
            "C. 基因编辑": 6,
            "E. 转基因": 1,
            "F. 生物医药": 2,
            "B. 干细胞": 2,
            "D. 基因测序": 2,
            "H. 疫苗": 2,
            "I. 克隆": 3,
            "K. 合成生物": 1,
            "G. 再生医学": 1,
            "J. 辅助生殖": 4
          }}
          labelClass={"grid grid-cols-2"}
          colors={[
            "rgb(87,215,236)",
            "rgb(236,55,97)",
            "rgba(126,10,241,0.5)",
            "#7bed9f",
            "rgb(62,238,211)",
            "#fd79a8",
            "rgb(236,119,199)",
            "#C62CF2",
            "rgba(255,211,12,0.88)",
            "rgba(229,53,255,0.9)",
            "#E29578"
          ]}
        />
        <PieChart
          title={"修读该课程的主要收获（可多选）"}
          data={{
            "A.对生命伦理学问题有了更多了解": 9,
            "C.增强了社会责任感和使命感": 6,
            "D. 对生命的价值有更加深刻的认识": 6,
            "E.增强了团队协作能力": 1,
            "B. 掌握生命伦理学基本价值原则": 4,
            "F.树立了正确的伦理观": 1,
            "G. 增加了生命伦理相关法律知识": 2
          }}
          colors={[
            "rgb(87,215,236)",
            "rgb(236,55,97)",
            "rgb(236,119,199)",
            "rgb(62,238,211)",
            "rgba(126,10,241,0.5)",
            "rgba(229,53,255,0.9)",
            "rgba(255,211,12,0.88)"
          ]}
        />
        <PieChart
          title={"你较喜欢该门课程所使用的哪种（哪些）教学方式?（可多选）"}
          data={{
            "B.教师组织网上讨论，学生参与发言": 5,
            "F. 案例讨论": 5,
            "E.课堂播放视频": 3,
            "A.教师课堂专题讲授": 5,
            "C.学生课后讨论，进行课堂汇报": 3
          }}
          colors={[
            "rgba(126,10,241,0.5)",
            "rgb(236,119,199)",
            "rgb(87,215,236)",
            "rgb(62,238,211)",
            "rgba(255,211,12,0.88)"
          ]}
        />
        <PieChart
          title={"你如何评价该课程的汇报讨论的形式和内容?"}
          data={{
            "A.学生选题范围较广，有一定的深度和趣味性.": 9,
            "B.通过学生汇报可扩充课堂教学的范围": 3,
            "C.有较多机会参与学生之间的讨论": 5,
            "D.学生之间缺乏有效讨论": 1
          }}
          colors={[
            "rgb(87,215,236)",
            "rgb(236,119,199)",
            "rgb(62,238,211)",
            "rgb(236,55,97)"
          ]}
        />
      </div>

      <div>
        <PieChart
          title={"你获取生物科技资讯的主要方式是（可多选）"}
          data={{
            "D.阅读文献": 24,
            "E.课堂": 21,
            "G.听讲座": 18,
            "F. 媒体（包括电视、报纸、微博、公众号等）": 21,
            "C.专业书籍": 12,
            "A.看电影": 4,
            "B.小说": 3,
            "H.其他 （他人分享）": 1
          }}
          colors={[
            "rgb(87,215,236)",
            "rgb(62,238,211)",
            "rgb(236,119,199)",
            "rgb(236,55,97)",
            "rgba(255,211,12,0.88)",
            "rgba(126,10,241,0.5)",
            "rgba(229,53,255,0.9)",
            "#7bed9f",
            "#E29578",
            "#fd79a8",
            "#C62CF2"
          ]}
        />
        <PieChart
          title={"你最关心的生物伦理学问题是（可多选）"}
          data={{
            "E.同性恋": 11,
            "F. 流浪猫": 11,
            "K.实验动物": 14,
            "L.人工智能": 10,
            "A. 衰老": 10,
            "C. 优生": 9,
            "G. 冻卵": 6,
            "I. 生物技术伦理": 12,
            "J. 医学技术伦理": 10,
            "D.代孕": 9,
            "B. 死亡": 18,
            "H.生态伦理": 11
          }}
          labelClass={"grid grid-cols-2"}
        />
        <PieChart
          title={"你最感兴趣的生物技术是（可多选）"}
          data={{
            "C. 基因编辑": 19,
            "I. 克隆": 9,
            "A. 基因工程": 11,
            "B. 干细胞": 7,
            "D. 基因测序": 12,
            "E. 转基因": 10,
            "F. 生物医药": 13,
            "G. 再生医学": 9,
            "H. 疫苗": 7,
            "J. 辅助生殖": 10,
            "K. 合成生物": 10
          }}
          labelClass={"grid grid-cols-2"}
        />
        <PieChart
          title={"修读该课程的主要收获（可多选）"}
          data={{
            "A.对生命伦理学问题有了更多了解": 26,
            "B. 掌握生命伦理学基本价值原则": 23,
            "C.增强了社会责任感和使命感": 20,
            "D. 对生命的价值有更加深刻的认识": 22,
            "E.增强了团队协作能力": 8,
            "F.树立了正确的伦理观": 20,
            "G. 增加了生命伦理相关法律知识": 16
          }}/>
        <PieChart
          title={"你较喜欢该门课程所使用的哪种（哪些）教学方式?（可多选）"}
          data={{
            "A.教师课堂专题讲授": 23,
            "C.学生课后讨论，进行课堂汇报": 11,
            "F. 案例讨论": 14,
            "B.教师组织网上讨论，学生参与发言": 10,
            "D.学生通过慕课自主学习": 14,
            "E.课堂播放视频": 15
          }}/>
        <PieChart
          title={"你如何评价该课程的汇报讨论的形式和内容?"}
          data={{
            "A.学生选题范围较广，有一定的深度和趣味性.": 22,
            "B.通过学生汇报可扩充课堂教学的范围": 19,
            "C.有较多机会参与学生之间的讨论": 9,
            "D.学生之间缺乏有效讨论": 4,
            "E.学生汇报内容不够精炼，很难吸引大家的兴趣": 1
          }}/>
      </div>
    </div>

    <h2>本科生组</h2>
    <div>
      {data.map(d => <RatioChart key={d.name} name={d.name} raw={d.data}/>)}
    </div>

    <h2>研究生组</h2>
    <div>
      {data_above.map(d => <RatioChart key={d.name} name={d.name} raw={d.data}/>)}
    </div>
  </div>
}

export default display
