import {PieChart, RatioChart} from "@/charts"

const data = [
  {
    "name": "7.修读该课程的满意度（指实际修读课程的收获与选课期望的比较）",
    "data": [
      {
        "name": "A 很满意",
        "value": 6
      },
      {
        "name": "B比较满意",
        "value": 2
      },
      {
        "name": "C一般",
        "value": 1
      }
    ]
  },
  {
    "name": "8. 你对该门课程所教授内容的评价如何?",
    "data": [
      {
        "name": "B.内容深浅合适，容易理解与接受",
        "value": 7
      },
      {
        "name": "D.有些内容深浅合适，有些偏难",
        "value": 2
      }
    ]
  },
  {
    "name": "10. 是否需要减少授课内容?",
    "data": [
      {
        "name": "内容合适",
        "value": 6
      },
      {
        "name": "否（）",
        "value": 2
      },
      {
        "name": "是（）如果希望减少，可以减少的内容〖生物学比较难的知识〗",
        "value": 1
      }
    ]
  },
  {
    "name": "12. 你对该门课程开设讨论课的实际效果如何评价?",
    "data": [
      {
        "name": "A.很满意",
        "value": 4
      },
      {
        "name": "B.满意",
        "value": 4
      },
      {
        "name": "D.不知道",
        "value": 1
      }
    ]
  }
]

const data_above = [
  {
    "name": "7.修读该课程的满意度（指实际修读课程的收获与选课期望的比较）",
    "data": [
      {
        "name": "A 很满意",
        "value": 21
      },
      {
        "name": "B比较满意",
        "value": 5
      },
      {
        "name": "C一般",
        "value": 1
      }
    ]
  },
  {
    "name": "8. 你对该门课程所教授内容的评价如何?",
    "data": [
      {
        "name": "B.内容深浅合适，容易理解与接受",
        "value": 24
      },
      {
        "name": "D.有些内容深浅合适，有些偏难",
        "value": 2
      },
      {
        "name": "C.内容较浅，之前均已掌握",
        "value": 1
      }
    ]
  },
  {
    "name": "10. 是否需要减少授课内容?",
    "data": [
      {
        "name": "内容合适",
        "value": 17
      },
      {
        "name": "否（）",
        "value": 10
      }
    ]
  },
  {
    "name": "12. 你对该门课程开设讨论课的实际效果如何评价?",
    "data": [
      {
        "name": "B.满意",
        "value": 16
      },
      {
        "name": "A.很满意",
        "value": 10
      },
      {
        "name": "D.不知道",
        "value": 1
      }
    ]
  }
]

const display = () => {

  return <div className={"grid place-content-center"}>
    <PieChart
      title={"你如何评价该课程的汇报讨论的形式和内容?"}
      data={{
        "A.学生选题范围较广，有一定的深度和趣味性.": 9,
        "B.通过学生汇报可扩充课堂教学的范围": 3,
        "C.有较多机会参与学生之间的讨论": 5,
        "D.学生之间缺乏有效讨论": 1
      }}/>
    <PieChart
      title={"是否需要增加授课内容?"}
      data={{
        "内容合适": 5,
        "是（）如果希望增加，可以增加的内容": 2,
        "否（）": 1,
        "是（）如果希望增加，可以增加的内容〖讨论〗": 1
      }}/>
    <PieChart
      title={"你获取生物科技资讯的主要方式是（可多选）"}
      data={{
        "A.看电影": 5,
        "D.阅读文献": 4,
        "F. 媒体（包括电视、报纸、微博、公众号等）": 7,
        "G.听讲座": 4,
        "B.小说": 5,
        "E.课堂": 8,
        "C.专业书籍": 3
      }}/>
    <PieChart
      title={"你最关心的生物伦理学问题是（可多选）"}
      data={{
        "H.生态伦理": 1,
        "I. 生物技术伦理": 6,
        "A. 衰老": 5,
        "E.同性恋": 4,
        "G. 冻卵": 4,
        "L.人工智能": 4,
        "B. 死亡": 6,
        "J. 医学技术伦理": 3,
        "K.实验动物": 2,
        "C. 优生": 3,
        "D.代孕": 4
      }}/>
    <PieChart
      title={"你最感兴趣的生物技术是（可多选）"}
      data={{
        "A. 基因工程": 4,
        "C. 基因编辑": 6,
        "E. 转基因": 1,
        "F. 生物医药": 2,
        "B. 干细胞": 2,
        "D. 基因测序": 2,
        "H. 疫苗": 2,
        "I. 克隆": 3,
        "K. 合成生物": 1,
        "G. 再生医学": 1,
        "J. 辅助生殖": 4
      }}/>
    <PieChart
      title={"修读该课程的主要收获（可多选）"}
      data={{
        "A.对生命伦理学问题有了更多了解": 9,
        "C.增强了社会责任感和使命感": 6,
        "D. 对生命的价值有更加深刻的认识": 6,
        "E.增强了团队协作能力": 1,
        "B. 掌握生命伦理学基本价值原则": 4,
        "F.树立了正确的伦理观": 1,
        "G. 增加了生命伦理相关法律知识": 2
      }}/>
    <PieChart
      title={"你较喜欢该门课程所使用的哪种（哪些）教学方式?（可多选）"}
      data={{
        "B.教师组织网上讨论，学生参与发言": 5,
        "F. 案例讨论": 5,
        "E.课堂播放视频": 3,
        "A.教师课堂专题讲授": 5,
        "C.学生课后讨论，进行课堂汇报": 3
      }}/>
    <div>
      {data.map(d => <RatioChart key={d.name} {...d}/>)}
    </div>
  </div>
}

export default display
